kwma1009/workspace_PCM-073/evkmimxrt1170_semc_cm7/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_25 (coord M15), LPUART1_RXD/J32[2] */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART1_RXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART1_RXD_SIGNAL                                    RXD   /*!< Signal name */

/* GPIO_AD_24 (coord L13), LPUART1_TXD/J31[2] */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART1_TXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART1_TXD_SIGNAL                                    TXD   /*!< Signal name */

/* GPIO_EMC_B1_00 (coord F3), SEMC_D0/U13[2] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D0_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D0_SIGNAL                                       DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D0_CHANNEL                                        0U   /*!< Signal channel */

/* GPIO_EMC_B1_01 (coord F2), SEMC_D1/U13[4]/U14A[J4] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D1_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D1_SIGNAL                                       DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D1_CHANNEL                                        1U   /*!< Signal channel */

/* GPIO_EMC_B1_02 (coord G4), SEMC_D2/U13[5] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D2_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D2_SIGNAL                                       DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D2_CHANNEL                                        2U   /*!< Signal channel */

/* GPIO_EMC_B1_03 (coord E4), SEMC_D3/U13[7] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D3_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D3_SIGNAL                                       DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D3_CHANNEL                                        3U   /*!< Signal channel */

/* GPIO_EMC_B1_04 (coord H5), SEMC_D4/U13[8] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D4_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D4_SIGNAL                                       DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D4_CHANNEL                                        4U   /*!< Signal channel */

/* GPIO_EMC_B1_05 (coord F4), SEMC_D5/U13[10] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D5_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D5_SIGNAL                                       DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D5_CHANNEL                                        5U   /*!< Signal channel */

/* GPIO_EMC_B1_06 (coord H4), SEMC_D6/U13[11] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D6_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D6_SIGNAL                                       DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D6_CHANNEL                                        6U   /*!< Signal channel */

/* GPIO_EMC_B1_07 (coord H3), SEMC_D7/U13[13] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D7_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D7_SIGNAL                                       DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D7_CHANNEL                                        7U   /*!< Signal channel */

/* GPIO_EMC_B1_30 (coord E3), SEMC_D8/U13[42] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D8_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D8_SIGNAL                                       DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D8_CHANNEL                                        8U   /*!< Signal channel */

/* GPIO_EMC_B1_31 (coord D2), SEMC_D9/U13[44] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D9_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D9_SIGNAL                                       DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D9_CHANNEL                                        9U   /*!< Signal channel */

/* GPIO_EMC_B1_32 (coord D1), SEMC_D10/U13[45] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D10_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D10_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D10_CHANNEL                                      10U   /*!< Signal channel */

/* GPIO_EMC_B1_33 (coord E2), SEMC_D11/U13[47] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D11_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D11_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D11_CHANNEL                                      11U   /*!< Signal channel */

/* GPIO_EMC_B1_34 (coord E1), SEMC_D12/U13[48] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D12_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D12_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D12_CHANNEL                                      12U   /*!< Signal channel */

/* GPIO_EMC_B1_35 (coord F1), SEMC_D13/U13[50] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D13_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D13_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D13_CHANNEL                                      13U   /*!< Signal channel */

/* GPIO_EMC_B1_36 (coord G1), SEMC_D14/U13[51] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D14_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D14_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D14_CHANNEL                                      14U   /*!< Signal channel */

/* GPIO_EMC_B1_37 (coord H1), SEMC_D15/U13[53] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D15_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D15_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D15_CHANNEL                                      15U   /*!< Signal channel */

/* GPIO_EMC_B1_09 (coord A3), SEMC_A0/U13[23]/U25[23] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A0_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A0_SIGNAL                                       ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A0_CHANNEL                                        0U   /*!< Signal channel */

