kwma1009/workspace_PCM-073/evkmimxrt1170_semc_cm7/board/pin_mux.h
/* GPIO_EMC_B1_10 (coord A2), SEMC_A1/U13[24]/U25[24] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A1_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A1_SIGNAL                                       ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A1_CHANNEL                                        1U   /*!< Signal channel */

/* GPIO_EMC_B1_11 (coord C2), SEMC_A2/U13[25]/U25[25] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A2_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A2_SIGNAL                                       ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A2_CHANNEL                                        2U   /*!< Signal channel */

/* GPIO_EMC_B1_12 (coord C5), SEMC_A3/U13[26]/U25[26] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A3_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A3_SIGNAL                                       ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A3_CHANNEL                                        3U   /*!< Signal channel */

/* GPIO_EMC_B1_13 (coord D5), SEMC_A4/U13[29]/U25[29] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A4_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A4_SIGNAL                                       ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A4_CHANNEL                                        4U   /*!< Signal channel */

/* GPIO_EMC_B1_14 (coord B1), SEMC_A5/U13[30]/U25[30] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A5_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A5_SIGNAL                                       ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A5_CHANNEL                                        5U   /*!< Signal channel */

/* GPIO_EMC_B1_15 (coord C1), SEMC_A6/U13[31]/U25[31] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A6_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A6_SIGNAL                                       ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A6_CHANNEL                                        6U   /*!< Signal channel */

/* GPIO_EMC_B1_16 (coord D3), SEMC_A7/U13[32]/U25[32] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A7_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A7_SIGNAL                                       ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A7_CHANNEL                                        7U   /*!< Signal channel */

/* GPIO_EMC_B1_17 (coord B3), SEMC_A8/U13[33]/U25[33] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A8_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A8_SIGNAL                                       ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A8_CHANNEL                                        8U   /*!< Signal channel */

/* GPIO_EMC_B1_18 (coord B4), SEMC_A9/U13[34]/U25[34]/U14A[D5] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A9_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A9_SIGNAL                                       ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A9_CHANNEL                                        9U   /*!< Signal channel */

/* GPIO_EMC_B1_23 (coord B2), SEMC_A10/U13[22]/U25[22] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A10_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A10_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A10_CHANNEL                                      10U   /*!< Signal channel */

/* GPIO_EMC_B1_19 (coord C4), SEMC_A11/U13[35]/U25[35]/U14A[C7] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A11_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A11_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A11_CHANNEL                                      11U   /*!< Signal channel */

/* GPIO_EMC_B1_20 (coord C3), SEMC_A12/U13[36]/U25[36]/U14A[D4] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A12_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A12_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A12_CHANNEL                                      12U   /*!< Signal channel */

/* GPIO_EMC_B1_21 (coord G2), SEMC_BA0/U13[20]/U25[20] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_BA0_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_BA0_SIGNAL                                        BA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_BA0_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_B1_22 (coord H2), SEMC_BA1/U13[21]/U25[21]/U14A[C4] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_BA1_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_BA1_SIGNAL                                        BA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_BA1_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_B1_26 (coord J3), SEMC_CLK/U13[38]/U25[38] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_CLK_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_CLK_SIGNAL                                  semc_clk   /*!< Signal name */

/* GPIO_EMC_B1_28 (coord E5), SEMC_WE/U13[16]/U25[16] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_WE_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_WE_SIGNAL                                    semc_we   /*!< Signal name */

/* GPIO_EMC_B1_24 (coord J5), SEMC_CAS/U13[17]/U25[17] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_CAS_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_CAS_SIGNAL                                  semc_cas   /*!< Signal name */

/* GPIO_EMC_B1_25 (coord J4), SEMC_RAS/U13[18]/U25[18] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_RAS_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_RAS_SIGNAL                                  semc_ras   /*!< Signal name */

