kwma1009/workspace_PCM-073/evkmimxrt1170_semc_cm7/board/pin_mux.h
/* GPIO_EMC_B1_08 (coord F5), SEMC_DM0/U13[15] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_DM0_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_DM0_SIGNAL                                        DM   /*!< Signal name */
#define BOARD_INITPINS_SEMC_DM0_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_B1_38 (coord J1), SEMC_DM1/U13[39] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_DM1_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_DM1_SIGNAL                                        DM   /*!< Signal name */
#define BOARD_INITPINS_SEMC_DM1_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_B2_00 (coord K2), SEMC_D16/U25[2] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D16_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D16_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D16_CHANNEL                                      16U   /*!< Signal channel */

/* GPIO_EMC_B2_01 (coord K4), SEMC_D17/U25[4] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D17_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D17_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D17_CHANNEL                                      17U   /*!< Signal channel */

/* GPIO_EMC_B2_02 (coord K3), SEMC_D18/U25[5] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D18_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D18_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D18_CHANNEL                                      18U   /*!< Signal channel */

/* GPIO_EMC_B2_03 (coord R1), SEMC_D19/U25[7] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D19_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D19_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D19_CHANNEL                                      19U   /*!< Signal channel */

/* GPIO_EMC_B2_04 (coord M1), SEMC_D20/U25[8] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D20_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D20_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D20_CHANNEL                                      20U   /*!< Signal channel */

/* GPIO_EMC_B2_05 (coord N1), SEMC_D21/U25[10] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D21_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D21_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D21_CHANNEL                                      21U   /*!< Signal channel */

/* GPIO_EMC_B2_06 (coord T1), SEMC_D22/U25[11] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D22_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D22_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D22_CHANNEL                                      22U   /*!< Signal channel */

/* GPIO_EMC_B2_07 (coord M3), SEMC_D23/U25[13] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D23_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D23_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D23_CHANNEL                                      23U   /*!< Signal channel */

/* GPIO_EMC_B2_09 (coord N2), SEMC_D24/U25[42] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D24_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D24_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D24_CHANNEL                                      24U   /*!< Signal channel */

/* GPIO_EMC_B2_10 (coord R2), SEMC_D25/U25[44] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D25_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D25_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D25_CHANNEL                                      25U   /*!< Signal channel */

/* GPIO_EMC_B2_11 (coord L4), SEMC_D26/U25[45] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D26_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D26_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D26_CHANNEL                                      26U   /*!< Signal channel */

/* GPIO_EMC_B2_12 (coord M2), SEMC_D27/U25[47] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D27_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D27_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D27_CHANNEL                                      27U   /*!< Signal channel */

/* GPIO_EMC_B2_13 (coord K5), SEMC_D28/U25[48] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D28_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D28_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D28_CHANNEL                                      28U   /*!< Signal channel */

/* GPIO_EMC_B2_14 (coord M4), SEMC_D29/U25[50] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D29_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D29_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D29_CHANNEL                                      29U   /*!< Signal channel */

/* GPIO_EMC_B2_15 (coord L2), SEMC_D30/U25[51] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D30_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D30_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D30_CHANNEL                                      30U   /*!< Signal channel */

/* GPIO_EMC_B2_16 (coord P2), SEMC_D31/U25[53] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D31_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D31_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D31_CHANNEL                                      31U   /*!< Signal channel */

/* GPIO_EMC_B2_08 (coord P1), SEMC_DM2/U25[15] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_DM2_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_DM2_SIGNAL                                        DM   /*!< Signal name */
#define BOARD_INITPINS_SEMC_DM2_CHANNEL                                       2U   /*!< Signal channel */

