kwma1009/workspace_PCM-073/evkmimxrt1170_semc_cm7/board/pin_mux.h
/* GPIO_EMC_B2_17 (coord T2), SEMC_DM3/U25[39] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_DM3_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_DM3_SIGNAL                                        DM   /*!< Signal name */
#define BOARD_INITPINS_SEMC_DM3_CHANNEL                                       3U   /*!< Signal channel */

/* GPIO_EMC_B1_27 (coord G5), SEMC_CKE/U13[37]/U25[37] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_CKE_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_CKE_SIGNAL                                  semc_cke   /*!< Signal name */

/* GPIO_EMC_B1_29 (coord E6), SEMC_CS0/U13[19]/U25[19] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_CS0_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_CS0_SIGNAL                                        CS   /*!< Signal name */
#define BOARD_INITPINS_SEMC_CS0_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_B1_39 (coord J2), SEMC_DQS */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_DQS_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_DQS_SIGNAL                                  semc_dqs   /*!< Signal name */

/* GPIO_EMC_B1_40 (coord K1), SEMC_RDY/U14A[C8] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_RDY_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_RDY_SIGNAL                                  semc_rdy   /*!< Signal name */

/* GPIO_EMC_B2_19 (coord U2), ENET_RGMII_MDC */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RGMII_MDC_PERIPHERAL                            SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RGMII_MDC_SIGNAL                                CLKX   /*!< Signal name */
#define BOARD_INITPINS_ENET_RGMII_MDC_CHANNEL                                 0U   /*!< Signal channel */

/* GPIO_EMC_B2_20 (coord R3), ENET_RGMII_MDIO */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RGMII_MDIO_PERIPHERAL                           SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RGMII_MDIO_SIGNAL                               CLKX   /*!< Signal name */
#define BOARD_INITPINS_ENET_RGMII_MDIO_CHANNEL                                1U   /*!< Signal channel */

/* GPIO_EMC_B1_41 (coord L1), SEMC_CSX0/U14A[C6] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_CSX0_PERIPHERAL                                 SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_CSX0_SIGNAL                                      CSX   /*!< Signal name */
#define BOARD_INITPINS_SEMC_CSX0_CHANNEL                                      0U   /*!< Signal channel */

/* GPIO_EMC_B2_18 (coord N3), SEMC_DQS4 */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_DQS4_PERIPHERAL                                 SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_DQS4_SIGNAL                                semc_dqs4   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
